{
  "text": "Something's wrong 'cause my mind is fading. And everywhere I look. There's a dead end waiting. Temperature's dropping at the rotten oasis. Stealing kisses from the leperous faces. . Heads are hanging from the garbage man trees. Mouthwash jukebox gasoline. Crystals are pointing. At a poor man's pockets. Smiling eyes ripping out of his sockets. . Got a devil's haircut in my mind. Got a devil's haircut in my mind. Got a devil's haircut in my mind. Got a devil's haircut in my mind. . Love machines on the sympathy crutches. Discount orgies on the dropout buses. Hitching a ride with the bleeding noses. Coming to town with the brief case blues. . Got a devil's haircut in my mind. Got a devil's haircut in my mind. Got a devil's haircut in my mind. Got a devil's haircut in my mind. . Something's wrong 'cause my mind is fading. Ghetto-blasting disintegrating. Rock 'n' roll, know what I'm saying. And everywhere I look. There's a devil waiting. . Got a devil's haircut in my mind. Got a devil's haircut in my mind. Got a devil's haircut in my mind. Got a devil's haircut in my mind. . Devil's haircut! In my mind!. Devil's haircut! In my mind!. Devil's haircut! In my mind!It takes a backwash manTo sing a backwash songLike a frying pan when the fire's goneDriving my pig while the band's taking pictures in the grassIn my radio smashedAnd I like pianos in the evening sunDragging my heels 'til my day is doneSaturday night in the captain's clothesTender horns blowing' in my jury 'frosYo soy un disco quebradoYo tengo chicle en el cerebro*I can't believe my way back whenMy Cadillac pants going much to fastKaraoke weekend at the suicide shackCommunity service and I'm still the MackShocked my finger, spots on my handI been spreading disease all across the landBeautiful air-conditioned,Sitting in the kitchenWishing I was living like a hit manFace down in the guaranteesJaundiced honchos getting' busy with meBecause I get down I get downI get down all the wayYo soy un disco quebradoYo tengo chicle en el cerebro*Sawdust songs of the plaid bartendersWestern Unions of the country westernsSilver foxes looking for romanceIn the chain-smokeKansas flash dance ass pantsAnd you got the hotwax residuesYou never lose in your razor blade shoesStealing pesos out of my brainHazard signs down the Alamo lanesRadar systems piercing the soulsYou never get caught with the wax so rottenAll my days I got the grizzly wordsHijacked flavors that I'm flipping like birdsYo soy un disco quebradoYo tengo chicle en el cerebro[Girl:] \"Who are you?\"[Man:] \"I'm the enchanting wizard of rhythm.\"[Girl:] \"Why did you come here?\"[Man:] \"I came here to tell you about the rhythms of the universe....\"  You only got one finger left And it's pointing at the door And you're taking for granted What the Lord's laid on the floor So I'm picking up the pieces And I'm putting them up for sale Throw your meal ticket out the window Put your skeletons in jail  'Cause Lord only knows it's getting late Your senses are gone so don't you hesitate To give yourself a call, Let your bottom dollars fall Throwing your two bit cares down the drain Invite me to the seven seas Like some seasick man You'll do whatever you please And I'll do whatever I can Titanic, fare thee well, My eyes are turning pink Don't call us when the new age Gets old enough to drink  'Cause Lord only knows it's getting late Your senses are gone so don't you hesitate Move on up the hill, There's nothing dead left to kill Throwing your two bit cares down the drain Odelay, odelay, odelay, odelay Odelay, odelay Just passing through Odelay, odelay, odelay, odelay  Going back to Houston Do the hotdog dance Going back to Houston To get me some pants..... She's got cigarette on each arm She's got the lily-white cavity crazes She's got a carburetor tied to the moon Pink eyes looking to the food of the ages  She's alone in the new pollution She's alone in the new pollution  She's got a hand on a wheel of pain She can talk to the mangling strangers She can sleep in a fiery bog Throwing troubles to the dying embers  She's alone in the new pollution She's alone in the new pollution She's alone in the new pollution She's alone in the new pollution  She's got a paradise camouflage Like a whip-crack sending me shivers She's the boat in a strip mine ocean Riding low on the drunken rivers  She's alone in the new pollution She's alone in the new pollution I dropped my anchor in the dead of night I packed my suitcase and threw it away I fell asleep in the funeral fire I gave my clothes to the policeman  Blow back derelict when Lay my soul in the foul of the air Blow back derelict when Lay my soul in the foul of the air  Shooting venom at the passers-by I'm hi-jacking stop the heaven down I put my eyes in a paper bag I'm spinning round like a gambling wheel  Blow back derelict when Lay my soul in the foul of the air Blow back derelict when Lay my soul in the foul of the air  I dropped my anchor in the dead of night I packed my suitcase and threw it away I fell asleep in the funeral fire I gave my clothes to the policeman  Blow back derelict when Lay my soul in the foul of the air Blow back derelict when Lay my soul in the foul of the air Keep on trucking' like a novacane hurricane Blowing static on the paranoid short-wave Short fuse, got to dismantle Code red: what's your handle?  Mission incredible undercover convoy Full-tilt chromosome cowboy X-ray search and destroy Smokestack blacktop novacane boy  Got some rum, longhorn drums Detonate with the suicide gate Test tube, stillborn and dazed drugstore plains in the razor's haze Got the momentum radioactive Lowdown!  Circumcised for the operation Full spectrum generation Cyanide ride down the turnpike After hours on the miracle mic  Grinding the gears eighteen wheels Pigs and robots riding on their heels Power through the roadblock Making a sandblast Diesel aluminum cruising like drain-o Down the horizon purple gasses Semi-trucks hauling their asses Novacane, hit the road expressway Explode!  Novacane! Novacane! I been drifting along In the same stale shoes Loose ends tying a noose In the back of my mind If you thought that you were making your way To where the puzzles and pagans lay I'll put it together: It's a strange invitation When I wake up Someone will sweep up my lazy bones And we will rise in the cool of the evening I remember the way that you smiled When the gravity shackles were wild And something is vacant When I think it's all beginning  I been drifting along In the same stale shoes Loose ends tying the noose In the back of my mind If you thought that you were making your way To where the puzzles and pagans lay I'll put it together: It's a strange invitation There's a destination a little up the road From the habitations and the towns we know A place we saw the lights turn low The jig-saw jazz and the get-fresh flow  Pulling out jives and jamboree handouts Two turntables and a microphone Bottles and cans just clap your hands Just clap your hands  Where it's at! I got two turntables and a microphone Where it's at! I got two turntables and a microphone Where it's at! I got two turntables and a microphone Where it's at!  [robot vocal effect:] I got two turntables and a microphone  (take me home with my elevator bones!) (that was a good drum break)  Pick yourself up off the side of the road With your elevator bones And your whip-flash tones Members only hyponotizers Move through the room like ambulance drivers Shine your shoes with your microphone blues Hirsute with your parachute fruits Passing the dutchie from coast to coast Let my man Ken Wilson (rock the most)  Where it's at! I got two turntables and a microphone Where it's at! I got two turntables and a microphone  [Man speaking:] (\"What about those who swing both ways? AC-DC's?\")  Two turntables and a microphone Two turntables and a microphone Two turntables and a microphone Two turntables and a microphone Two turntables and a microphone Two turntables and a microphone  Where it's at! I got two turntables and a microphone Where it's at! I got two turntables and a microphone  Oh, dear me. Make-out City's a two-horse town  [girl speaking:] (\"That's beautiful, Dad.\")  (Got my microphone....) There's a destination a little up the road From the habitations and the towns we know A place we saw the lights turn low The jig-saw jazz and the get-fresh flow  Pulling out jives and jamboree handouts Two turntables and a microphone Bottles and cans and just clap your hands And just clap your hands  Where it's at! I got two turntables and a microphone Where it's at! I got two turntables and a microphone  I got plastic on my mind (make it out, baby) yeah, yeah, yeah let's make it out, baby yeah, yeah, yeah, yeah  telephone plastic baby Ah, so good oh, yeah let's play good ow wow wow wow wow"
}
