{
  "text": "le1. (a) Debtor, in consideration of the agreement of Secured Party to make a loan to Debtor pursuant to that certain Secured Note Purchase Agreement, of even date herewith, between Debtor and Secured Party (the “Purchase Agreement”), and for other good and sufficient consideration, hereby grants to Secured Party a first priority security interest in all of Debtor’s right, title and interest in and to all of the Debtor’s personal property and assets including without limitation the following property (except as set forth herein), including without limitation any and all additions, accessions and substitutions thereto or therefore, whether now held or hereafter acquired (hereinafter called the “Collateral”): (a) Accounts; (b) Instruments; (c) Documents; (d) Chattel Paper; (e) Supporting Obligations; (f) Letter of Credit Rights; (g) Equipment; (h) Fixtures; (i) General Intangibles; (j) Inventory; (k) Investment Property; (l) Deposit Accounts; (m) cash, money, currency, and liquid funds, wherever held; (n) Goods; (o) Intellectual Property; and (p) all Proceeds of each of the foregoing, to secure payment of the unpaid principal amount of and interest on the Note (as defined in the Purchase Agreement) and all other obligations and liabilities of Debtor to Secured Party, whether direct or indirect, absolute or contingent, due or to become due, or now existing or hereafter incurred, which may arise under, out of, or in connection with, the Purchase Agreement or this Security Agreement and any other document executed and delivered in connection therewith or herewith and each other obligation and liability, whether direct or indirect, absolute or contingent, due or to become due, or now or hereafter existing, of the Debtor to Secured Party, whether on account of principal, interest, reimbursement obligations, fees, indemnities, costs, expenses (including, without limitation, all fees and disbursements of counsel to Secured Party) or otherwise (the “Obligations”). (b) Capitalized terms used herein and not otherwise defined shall have the meaning set forth in the Uniform Commercial Code of the State of Delaware (the “UCC”). For purposes hereof, the following definitions shall apply: “Intellectual Property” means, collectively, all rights, priorities and privileges of the Debtor relating to intellectual property, whether arising under United States, multinational or foreign laws or otherwise, including copyrights, copyright licenses, inventions, patents, patent licenses, trademarks, trademark licenses and trade secrets (including customer lists), domain names, Web sites and know-how, including, but not limited to, the patents, trademarks and copyrights set forth on Schedule 4(n) of the Purchase Agreement. 2. Debtor expressly represents, warrants and covenants: (a) That except for the first priority security interest granted hereby, the lien in favor of 550 Digital Media Ventures, Inc. (“550 DMV”) which is pari passu with the security interest created hereby and applies to all of the same Collateral, and the permitted liens listed on Schedule A hereto (the “Permitted Liens”), Debtor is the owner of the Collateral free from any adverse lien, security interest or encumbrances; and that Debtor will defend the Collateral against all claims and demands of all persons at anytime claiming the same or any interest therein. The security interest granted pursuant to this Security Agreement will constitute a valid and continuing first priority perfected security interest in favor of the Secured Party in the Collateral for which perfection is governed by the UCC or filing with the United States Copyright Office or United States Patent and Trademark Office. Such security interest will be prior to all other liens on the Collateral, except for Permitted Liens. (b) That Debtor has the full power and authority to enter into this Security Agreement, that this Security Agreement has been duly authorized, executed, and delivered by the Debtor and Debtor’s obligations under this Security Agreement are legal, valid, binding, absolute and unconditional. (c) That Debtor’s location is as stated above and the Collateral will be kept at that location or at the locations of Debtor’s subsidiaries. (d) That Debtor will promptly notify Secured Party of any change in the location of the Collateral. (e) That Debtor will pay all taxes and assessments of every nature which may be levied or assessed against the Collateral. (f) That, except for liens disclosed herein or in the Schedules hereto, Debtor will not permit or allow any adverse lien, security interest or encumbrance whatsoever upon the Collateral and will not permit the same to be attached or replevined. (g) That Debtor has used, and will continue to use for the duration of this Security Agreement, consistent standards of quality in its provision of services sold under Debtor’s service marks. Debtor shall use its best efforts to do any and all acts required by Secured Party to ensure Debtor’s compliance with this subparagraph. (h) That the Collateral is in good condition, and that Secured Party may examine and inspect the Collateral at any time, wherever located. Without limiting the generality of 2 the foregoing, Debtor hereby grants to Secured Party and its employees and agents the right to visit Debtor’s offices from which services are provided under any of Debtor’s service marks, and to inspect the quality control relating thereto at reasonable times during regular business hours. (i) That Debtor will not do any act, or omit to do any act, whereby Debtor’s service marks or any registration or application appurtenant thereto, may become abandoned, invalidated, unenforceable, avoided, avoidable, or will otherwise diminish in value, and shall notify Secured Party immediately if it knows of any reason or has reason to know of any ground under which this result may occur. Debtor shall take appropriate action at its expense to halt the infringement of Debtor’s service marks and shall properly exercise its duty to control the nature and quality of the goods offered by any licensees in connection therewith. (j) That Debtor will not use the Collateral in violation of any applicable statutes, regulations or ordinances or rights to any third parties. (k) That Debtor will keep the Collateral at all times insured against risks of loss or damage by fire, theft and such other casualties as Secured Party may reasonably require, all in such amounts, under such forms of policies, upon such terms, for such periods, and written by such companies or underwriters as Secured Party may approve, losses in all cases to be payable to Secured Party and Debtor as their interest may appear. Secured Party may act as attorney for Debtor in making, adjusting and settling claims under or canceling such insurance and endorsing Debtor’s name on any drafts drawn by insurers of the Collateral. (l) At any time and from time to time, upon the request of Secured Party, Debtor will promptly and duly execute and deliver any and all such further instruments and documents and take such further action as Secured Party may reasonably deem desirable in obtaining the full benefits of this Security Agreement, including, without limitation, the filing of any financing or continuation statement under the Uniform Commercial Code with respect to the liens and security interests granted hereby. Debtor hereby authorizes Secured Party to file any such financing or continuation statement without the signature of Debtor to the extent permitted by applicable law. (m) That Debtor hereby indemnifies and holds Secured Party, its officers, directors, employees, affiliates, partners and shareholders, harmless from and against any claim, suit, loss, damage or expense (including reasonable attorneys’ fees) arising out of this Security Agreement, the Purchase Agreement, or Debtor’s operation of its business from the use of the Collateral. (n) That, subject to Secured Party’s Intercreditor Agreement with 550 DMV, Debtor hereby irrevocably appoints Secured Party, and its successors and assigns, Debtor’s true and lawful attorney, with full power (in the name of Debtor or otherwise), after the occurrence and during the continuance of an Event of Default (defined in Section 4 below), to ask, require, demand, receive, compound and give acquittance for any and all moneys, claims and other amounts due and to 3 become due at any time under, or arising out of, the Collateral; to endorse any checks or other instruments or orders in connection therewith; to enforce all Secured Party’s rights hereunder, to enter into all agreements or instruments required to carry out the terms hereof which are required to be performed by Debtor; to execute such other assignments and mortgages of the Collateral as Secured Party may deem to be necessary or advisable. Such power of attorney shall be deemed a power coupled with an interest and, therefore, irrevocable. (o) Without thirty (30) days’ prior written notice to, and the prior written consent from, the Secured Party, the Debtor shall not (i) change the Debtor’s name, state of incorporation or organization, organizational identification number or place of business (or, if the Debtor has more than one place of business, its chief executive office). (p) In no event shall the Debtor, either itself or through any agent, employee, licensee or designee, file an application for the registration of any patent, trademark or copyright with the United States Patent and Trademark Office, the United States Copyright Office or any similar office or agency without giving the Secured Party prior written notice thereof, and, upon request of the Secured Party, the Debtor shall execute and deliver any and all security documents as the Secured Party may request to evidence the Secured Party’s Lien on such Intellectual Property and the general intangibles of the Debtor relating thereto or represented thereby. The Debtor hereby authorizes the Secured Party to amend this Agreement (without any further action or consent from the Debtor) to include any such patent, trademark or copyright as Collateral hereunder. 3. Until an Event of Default, Debtor may have possession of the Collateral and use it in any lawful manner, and upon an Event of Default, Secured Party shall have the immediate right to the possession of the Collateral. The powers conferred on the Secured Party by this Section 3 are solely to protect the Secured Party’s interests in the Collateral and shall not impose any duty upon it to exercise any such powers. The Secured Party shall be accountable only for amounts that it actually receives as a result of the exercise of such powers, and neither the Secured Party nor any of its officers, directors, employees or agents shall, in the absence of willful misconduct or gross negligence, be responsible to the Debtor for any act or failure to act pursuant to this Section 3. 4. Debtor shall be in default under this Security Agreement upon the happening of any of the following events or conditions (each an “Event of Default”): (a) default in the payment or performance of any obligation, covenant or liability contained or referred to herein or in any note evidencing the same; (b) the making or furnishing of any warranty, representation or statement to Secured Party by or on behalf of Debtor which proves to have been false in any material respect when made or furnished; 4 (c) loss, theft, damage, destruction, sale or encumbrance to or of any of the Collateral, or the making of any levy seizure or attachment thereof or thereon and, if capable of being remedied, such default shall continue unremedied for a period of 30 days; (d) dissolution, termination of existence, insolvency, business failure, appointment of a receiver of any part of the property of, assignment for the benefit of creditors by, or the commencement of any proceeding under any bankruptcy or insolvency laws of, by or against Debtor or any guarantor or surety for Debtor; (e) any Event of Default under the Purchase Agreement; and Debtor shall give Secured Party immediate notice of the occurrence of any matter referred to in clause (d) of this paragraph. 5. Subject to the Intercreditor Agreement with 550 DMV, upon such default and at any time thereafter, Secured Party may declare all obligations secured hereby immediately due and payable and shall have the remedies of a secured party under Article 9 of the Uniform Commercial Code. Secured Party may require Debtor to assemble the Collateral and deliver or make it available to Secured Party at a place to be designated by Secured Party which is reasonably convenient to both parties. Expenses of taking, holding, preparing for sale, or selling the Collateral or the like shall include Secured Party’s reasonable attorney’s fees and legal expenses. If an Event of Default has occurred and is continuing, the Secured Party may exercise, in addition to all other rights and remedies granted to it in this Agreement and in any other instrument or agreement relating to the Obligations, all rights and remedies of a secured party under the UCC. Without limiting the foregoing, the Secured Party, without demand of performance or other demand, presentment, protest, advertisement or notice of any kind (except any notice required by law) to or upon the Debtor or any other person (all of which demands, defenses, advertisements and notices are hereby waived), may in such circumstances collect, receive, appropriate and realize upon any or all of the Collateral, and/or may sell, lease, assign, give an option or options to purchase, or otherwise dispose of and deliver any or all of the Collateral (or contract to do any of the foregoing), in one or more parcels at a public or private sale or sales, at any exchange, broker’s board or office of the Secured Party or elsewhere upon such terms and conditions as the Secured Party may deem advisable, for cash or on credit or for future delivery without assumption of any credit risk. The Secured Party shall apply the net proceeds of any such collection, recovery, receipt, appropriation, realization or sale, after deducting all reasonable expenses incurred therein or in connection with the care or safekeeping of any of the Collateral (including, without limitation, reasonable attorneys’ fees and expenses) to the payment in whole or in part of the Obligations, in such order as the Secured Party may elect, and only after such application and after the payment by the Secured Party of any other amount required by any provision of law, need the Secured Party account for the surplus, if any, to the Debtor. To the extent permitted by applicable law, the Debtor waives all claims, damages and demands it may acquire against the Secured Party arising out of the exercise by the Secured Party of any of its rights hereunder. If any notice of a proposed sale or other disposition of Collateral shall be required by law, such notice shall be deemed reasonable and proper if given at least ten (10) days before such sale or other disposition. The Debtor shall remain liable for any deficiency if the proceeds of any sale or other disposition of the Collateral are insufficient to pay 5 the Obligations and the fees and disbursements of any attorneys employed by the Secured Party to collect such deficiency. In furtherance of the Secured Party’s rights hereunder while an Event of Default has occurred and is continuing, the Debtor hereby grants to the Secured Party an irrevocable, non-exclusive license (exercisable without royalty or other payment by the Secured Party) to use, license or sublicense any patent, trademark, tradename, copyright or other Intellectual Property in which the Debtor now or hereafter has any right, title or interest together with the right of access to all media in which any of the foregoing may be recorded or stored. 6. No waiver by Secured Party of any Event of Default shall operate as a waiver of any other Event of Default or of the same Event of Default on a future occasion. The taking of this Security Agreement shall not waive or impair any other security said Secured Party may have or hereafter acquire for the payment of the above indebtedness, nor shall the taking of any such additional security waive or impair this Security Agreement; but said Secured Party may, resort to any security it may have in the order it may deem proper, and notwithstanding any collateral security, Secured Party shall retain its rights of set-off against Debtor. 7. Secured Party’s rights hereunder shall be senior to the rights of any other person except for 550 DMV and as listed on Schedule A hereto. 8. All rights of Secured Party hereunder shall inure to the benefit of its successors and assigns; and all promises and duties of Debtor shall bind his heirs, executors or administrators or his or its successors or assigns. If there be more than one Debtor, their liabilities hereunder shall be joint and several. 9. THIS SECURITY AGREEMENT SHALL BE GOVERNED BY, AND CONSTRUED AND ENFORCED IN ACCORDANCE WITH, THE LAWS OF THE STATE OF CALIFORNIA, EXCLUDING CONFLICT OF LAWS PRINCIPLES THAT WOULD CAUSE THE APPLICATION OF LAWS OF ANY OTHER JURISDICTION. 10. This Security Agreement may be executed in counterparts, each of which shall be deemed an original but all of which together shall constitute one and the same instrument." 
}
